Repository: HolmesZhao/SocksApp
Catalog: SocksApp/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# about.current_connections
source: Current Connections
zh_hans: 当前连接

# about.description
source: A local network debugging tool for authorized use. It listens on the personal hotspot or LAN address and supports TCP CONNECT and UDP_ASSOCIATE.
zh_hans: 面向授权场景的本地网络调试工具，监听本机热点/局域网地址并支持 TCP CONNECT 与 UDP_ASSOCIATE。

# about.listen_address
source: Listen Address
zh_hans: 监听地址

# about.traffic
source: Traffic
zh_hans: 流量

# about.version
source: Version
zh_hans: 版本

# access.mode.authenticated
source: Authenticated
zh_hans: 认证模式

# access.mode.open
source: Open Mode
zh_hans: 开放模式

# accessibility.copy_value
source: Copy %@
zh_hans: 复制%@

# accessibility.save_port
source: Save Port
zh_hans: 保存端口

# accessibility.start_proxy
source: Start SOCKS5 Proxy
zh_hans: 启动 SOCKS5 代理

# accessibility.stop_proxy
source: Stop SOCKS5 Proxy
zh_hans: 停止 SOCKS5 代理

# alert.no_network.message
source: Please enable Personal Hotspot in Settings and try again.
zh_hans: 请在系统设置中开启个人热点后重试。

# alert.no_network.title
source: No Network Interface
zh_hans: 没有可用网络接口

# app.positioning
source: Local SOCKS5 server for development and debugging.
zh_hans: 用于开发和调试的本地 SOCKS5 服务。

# auth.auth_mode.restart
source: Authentication mode enabled. Restarting proxy service.
zh_hans: 已开启认证模式，代理服务正在自动重启

# auth.generate_token
source: Generate Temporary Token
zh_hans: 生成临时 token

# auth.open_mode
source: Open Mode
zh_hans: 开放模式

# auth.open_mode.hint
source: Username and temporary token are required by default. Open Mode is only for fully trusted local networks.
zh_hans: 默认需要用户名和临时 token。开放模式仅适合完全受信任的本地网络。

# auth.open_mode.restart
source: Open Mode enabled. Restarting proxy service.
zh_hans: 已切换到开放模式，代理服务正在自动重启

# auth.token_regenerated.restart
source: New temporary token generated. Restarting proxy service.
zh_hans: 已生成新的临时 token，代理服务正在自动重启

# common.copy_all
source: Copy All
zh_hans: 复制全部

# common.done
source: Done
zh_hans: 完成

# common.ok
source: OK
zh_hans: 好

# common.share
source: Share
zh_hans: 分享

# common.yes
source: Yes
zh_hans: 是

# footer.running
source: Running
zh_hans: 运行中

# footer.stopped
source: Stopped
zh_hans: 未运行

# footer.version
source: Version %@
zh_hans: 版本 %@

# hero.listen_port
source: Listen Port
zh_hans: 监听端口

# hero.local_ip
source: Local IP
zh_hans: 本机 IP

# metric.connections
source: Connections
zh_hans: 连接数

# metric.uptime
source: Uptime
zh_hans: 运行时间

# network.status.ready
source: Network address updated. Tap the power button to start the proxy service.
zh_hans: 网络地址已更新，点击电源按钮可启动代理服务。

# network.status.restart
source: Network changed. Restarting proxy service with the new IP address.
zh_hans: 检测到网络变化，正在使用新 IP 自动重启代理服务。

# port.error.invalid
source: Enter a port from 1 to 65535.
zh_hans: 请输入 1-65535 之间的端口号

# port.status.invalid
source: Port not saved. Check the input.
zh_hans: 端口未保存，请检查输入

# port.status.no_network_retry
source: No available network interface. Enable Personal Hotspot or connect to a LAN, then tap the power button to retry.
zh_hans: 没有可用网络接口。开启个人热点或连接局域网后，点击电源按钮重试。

# port.status.restart_after_save
source: The proxy service restarts after the port is saved.
zh_hans: 端口保存后会自动重启代理服务

# port.status.saved_restart
source: Port saved. Restarting proxy service.
zh_hans: 端口已保存，代理服务正在自动重启

# port.status.stopped
source: Proxy service stopped. Tap the power button to restart.
zh_hans: 代理服务已停止，点击电源按钮可重新启动

# port.status.unchanged
source: Port unchanged. Current service keeps running.
zh_hans: 端口未变化，当前服务继续运行

# privacy.auth_hint
source: SOCKS5 username and temporary token are enabled by default. Open Mode should only be used on fully trusted local networks.
zh_hans: 默认启用 SOCKS5 用户名和临时 token。开放模式只应在完全受信任的本地网络中使用。

# privacy.local_only.body
source: No traffic upload, no data sales, and logs stay only on this device. Username and temporary token are required by default.
zh_hans: 不上传流量、不出售数据，日志仅保存在本机。默认需要用户名和临时 token 才能连接。

# privacy.local_only.subtitle
source: Local SOCKS5 server for development and debugging. Use it only on local networks you authorize.
zh_hans: Local SOCKS5 server for development and debugging. 仅在你授权的本地网络中使用。

# privacy.local_only.title
source: Local Network Only
zh_hans: 仅本地网络使用

# privacy.summary
source: No traffic upload, no data sales, and logs stay only on this device.
zh_hans: 不上传流量、不出售数据，日志仅保存在本机。

# privacy.title
source: Privacy
zh_hans: 隐私

# proxy.access_mode
source: Access Mode
zh_hans: 访问模式

# proxy.info.title
source: Proxy Info
zh_hans: 代理信息

# proxy.port
source: Port
zh_hans: 端口

# proxy.server
source: Server Address
zh_hans: 服务器地址

# proxy.temporary_token
source: Temporary Token
zh_hans: 临时 token

source: Proxy Type
zh_hans: 代理类型

# proxy.udp
source: UDP Support
zh_hans: UDP 支持

# proxy.username
source: Username
zh_hans: 用户名

# status.network_restarting
source: Restarting after network change
zh_hans: 网络变化后正在重启

# status.subtitle.running
source: Proxy service is running
zh_hans: 代理服务正在运行中

# status.subtitle.waiting_network
source: Waiting for an available network interface
zh_hans: 等待可用网络接口

# status.title.running
source: SOCKS5 Proxy Running
zh_hans: SOCKS5 代理已启动

# status.title.stopped
source: SOCKS5 Proxy Stopped
zh_hans: SOCKS5 代理未启动

# tab.about
source: About
zh_hans: 关于

# tab.home
source: Home
zh_hans: 首页

# tab.logs
source: Connections
zh_hans: 连接

# usage.computer.subtitle
source: Set address to %@, port to %@, and type to SOCKS5
zh_hans: 地址 %@，端口 %@，类型选择 SOCKS5

# usage.computer.title
source: Set Proxy on Your Computer
zh_hans: 在电脑上设置代理

# usage.hotspot.subtitle
source: Make sure your computer is connected to this iPhone's Personal Hotspot
zh_hans: 确保电脑已连接到当前 iPhone 的个人热点

# usage.hotspot.title
source: Connect to This Hotspot
zh_hans: 连接到本机热点

# usage.title
source: How to Use
zh_hans: 如何使用
